var fake_data = {
    slice: {
        rows: [{
            uniqueName: '产品信息',
            sort: 'asc',
        }, ],
        columns: [{
            uniqueName: '产品参数',
            sort: 'asc',
        }, ],
        measures: [{
            uniqueName: '实际出货金额',
            // 聚合方式：比如 求和，求平均值，求方差
            aggregation: 'sum',
        }, {
            uniqueName: '同比增长',
            // 聚合方式：比如 求和，求平均值，求方差
            aggregation: 'sum',
        }],
        drills: {
            drillAll: false,
            rows: [{
                tuple: ['Business Type.Warehouse'],
            }, ],
        },
    },
    data: [
        {
            // 横向head字段
            品牌: {
                type: 'level',
                hierarchy: '产品信息',
            },
            品类: {
                type: 'level',
                hierarchy: '产品信息',
                parent: '品牌',
            },
            品牌组: {
                type: 'level',
                hierarchy: '产品信息',
                parent: '品类',
            },
            规格: {
                type: 'level',
                hierarchy: '产品信息',
                parent: '品牌组',
            },
            包装: {
                type: 'level',
                hierarchy: '产品信息',
                parent: '规格',
            },
            口味: {
                type: 'level',
                hierarchy: '产品信息',
                parent: '包装',
            },
            入数: {
                type: 'level',
                hierarchy: '产品信息',
                parent: '口味',
            },
            同价码: {
                type: 'level',
                hierarchy: '产品信息',
                parent: '入数',
            },
            产品编码: {
                type: 'level',
                hierarchy: '产品信息',
                parent: '同价码',
            },
            克重: {
                type: 'level',
                hierarchy: '产品信息',
                parent: '产品编码',
            },

            // 纵向head字段
            实际出货金额: {
                type: 'level',
                hierarchy: '产品参数',
            },
            预算出货金额: {
                type: 'level',
                hierarchy: '产品参数',
            },
            预算出货达成: {
                type: 'level',
                hierarchy: '产品参数',
            },
            同比增长: {
                type: 'level',
                hierarchy: '产品参数',
            },
            // 元数据

        },
        {
            品牌:'老陈醋酸辣牛肉面',
            品类:'大食袋单包',
            品牌组:'北方品牌组',
            规格:'大食袋',
            包装:'单包',
            口味:'酸辣牛肉',
            入数:'24入',
            同价码:'1MW',
            产品编码:'大食袋120g-24-1',
            克重:'120g',
            实际出货金额:33,
            预算出货金额:22,
            预算出货达成:44,
            同比增长:18
        },
        {
            品牌:'老陈醋酸辣牛肉面',
            品类:'大食袋单5包',
            品牌组:'北方品牌组',
            规格:'大食袋',
            包装:'5包',
            口味:'酸辣牛肉',
            入数:'24入+1',
            同价码:'1MW',
            产品编码:'大食袋120g-24-2',
            克重:'120g',
            实际出货金额:13,
            预算出货金额:82,
            预算出货达成:14,
            同比增长:22
        },
        {
            品牌:'老陈醋酸辣牛肉面',
            品类:'大食袋单5包',
            品牌组:'北方品牌组',
            规格:'大食袋',
            包装:'5包',
            口味:'酸辣牛肉',
            入数:'24入+1',
            同价码:'1MW',
            产品编码:'大食袋120g-24-3',
            克重:'120g',
            实际出货金额:73,
            预算出货金额:32,
            预算出货达成:1,
            同比增长:2
        },
        {
            品牌:'老陈醋酸辣牛肉面',
            品类:'大食袋单5包',
            品牌组:'北方品牌组',
            规格:'大食袋',
            包装:'单包',
            口味:'酸辣牛肉',
            入数:'24入+2',
            同价码:'1MW',
            产品编码:'大食袋120g-24-3',
            克重:'120g',
            实际出货金额:13,
            预算出货金额:82,
            预算出货达成:14,
            同比增长:27
        },{
            品牌:'老陈醋酸辣牛肉面',
            品类:'大食袋单5包',
            品牌组:'北方品牌组',
            规格:'大食袋',
            包装:'5包',
            口味:'酸辣牛肉',
            入数:'30入',
            同价码:'1MW',
            产品编码:'大食袋120g-24-3',
            克重:'120g',
            实际出货金额:133,
            预算出货金额:811,
            预算出货达成:13,
            同比增长:1
        },
        {
            品牌:'老陈醋酸辣牛肉面',
            品类:'大食袋单5包',
            品牌组:'北方品牌组',
            规格:'大食袋',
            包装:'5包',
            口味:'酸辣牛肉',
            入数:'30入',
            同价码:'1MW',
            产品编码:'大食袋120g-24-1',
            克重:'120g',
            实际出货金额:131,
            预算出货金额:822,
            预算出货达成:134,
            同比增长:17
        }
    ]
}